Assignment_2/src/tests/load/task-load-test.yml
config:
  target: http://localhost:8080
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Warm up phase
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: Ramp up load
    - duration: 30
      arrivalRate: 100
      # rampTo: 30
      name: Sustained peak load
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
              url: "/api/users"
          - get:
              url: "/api/users/cm0tozzi00000ood8jj0gy01p"
          # - get:
          #     url: "/api/armadillo"
        count: 100